'''
Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
- 4 -> [1, 2, 6, 24]
- 6 -> [1, 2, 6, 24, 120, 720]
'''

a = int(input("Введите целое N: "))
x = 1
mul = 1
list = []
while x <= a:
    mul*= x
    list.append(mul)
    x+=1
print (list)


